{"id":1464,"date":"2021-04-04T16:46:57","date_gmt":"2021-04-04T16:46:57","guid":{"rendered":"https:\/\/www.europeandocsexpress.com\/?p=1464"},"modified":"2022-05-26T18:03:04","modified_gmt":"2022-05-26T18:03:04","slug":"how-to-get-your-residence-permit-in-germany","status":"publish","type":"post","link":"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/","title":{"rendered":"How to get your residence permit in Germany"},"content":{"rendered":"<div class=\"iv iw ix iy iz ja\">\n<div class=\"at au av aw kh\">\n<p class=\"\">If you’re from outside the EU and you’ve decided to move to <a href=\"https:\/\/www.europeandocsexpress.com\/residence-permit-germany\/\">Germany<\/a>, there’s one major piece of paperwork you need to take care of—the residence permit, or&nbsp;<em>Aufenthaltstitel<\/em>. This is the document that provides legal status to live in Germany for a longer period of time than your temporary traveling visa. We’ve previously offered guides on how to open a bank account, how to register your address and how to get health insurance in Germany, because you’ll probably need proof of all three before you proceed. But before we get into all of that, let’s clarify some possible confusion.<\/p>\n<div class=\"lr ls\">\n<div class=\"kp lt\">\n<h2 id=\"the-difference-between-a-visa-and-a-residence-permit\" class=\"at av bm dv gi gk gl gm go gp hr lu lv lw lx\"><strong>The difference between a visa and a residence permit<\/strong><\/h2>\n<\/div>\n<\/div>\n<p class=\"\">A travel, business or student “visa” allows you to enter Germany and stay for up to 90 days. If you’re a citizen of the United States, Canada, Mexico, Australia, New Zealand, Japan, South Korea or most of South America (full list here), you don’t need to submit a separate application to enter Germany. You can freely enter and exit the country through the regular process whereby a border agent inspects your passport and leaves a dated stamp. If you’re a citizen of China, India, Russia or most of Africa, you do have to make a separate visa application to enter Germany. This is not the same thing as a “residence permit”—which, as the name implies, allows you to live in Germany for a longer period of time. Whether you intend to work as an employee, freelancer, artist, or plan to be a student at a university or language school, this guide will explain how to apply for a residence permit, and how to eventually apply for permanent residence.<\/p>\n<div class=\"lr ls\">\n<div class=\"kp lt\">\n<h2 id=\"applying-for-your-residence-permit-as-an-employee\" class=\"at av bm dv gi gk gl gm go gp hr lu lv lw lx\"><strong>Applying for your residence permit as an employee<\/strong><\/h2>\n<\/div>\n<\/div>\n<p class=\"\">The first step in getting your German residence permit is to decide what you’ll be doing while living in Germany. If you’re interested in working for a company, you must be able to demonstrate that you’re a highly qualified applicant, and your company must prove to the Federal Employment Agency (<em>Bundesagentur für Arbeit<\/em>) that you deserve a position more than a German or EU citizen, because of what’s known as the Priority Principle (<em>Vorrangprinzip<\/em>).<\/p>\n<p class=\"\">To get your residence permit to work in Germany, your application must include:<\/p>\n<ul>\n<li>\n<p class=\"\">Valid passport—make sure your passport will not expire during the length of your residence permit<\/p>\n<\/li>\n<li>\n<p class=\"\">1 current 35mm x 45mm biometric photo—you can take one at any Fotofix booth located in U-Bahn stations around the country<\/p>\n<\/li>\n<li>\n<p class=\"\">Proof of income—your German bank statements will do<\/p>\n<\/li>\n<li>\n<p class=\"\">Proof of employment—your work contract will do<\/p>\n<\/li>\n<li>\n<p class=\"\">Proof of health insurance—your health insurance card will do<\/p>\n<\/li>\n<li>\n<p class=\"\">Proof of residence—your address registration (<em>Meldebescheinigung<\/em>) will do<\/p>\n<\/li>\n<li>\n<p class=\"\">Completed residence permit application form—also known as the&nbsp;<em>Antrag auf Erteilung eines Aufenthaltstitels<\/em><\/p>\n<\/li>\n<li>\n<p class=\"\">Completed employment permission form—also known as the&nbsp;<em>Antrag auf Erlaubnis einer Beschäftigung<\/em><\/p>\n<\/li>\n<li>\n<p class=\"\">Completed job description form—also known as the&nbsp;<em>Stellenbeschreibung<\/em><\/p>\n<\/li>\n<li>\n<p class=\"\">€50 to €110 application fee, depending on the complexity of your case<\/p>\n<\/li>\n<\/ul>\n<p class=\"\">If you’ve already taken care of the three major steps—<a class=\"ap ar ax ay az ba bb bc bd be bf bg bh bj bk bn je jf jg jh ji jj ly lz\" href=\"https:\/\/n26.com\/en-eu\">bank account<\/a>, address registration, and health insurance—you should already be in good shape to apply. Your company will prepare your application documents and send them to the Foreigners’ Office (<em>Ausländerbehörde)<\/em>, and they will review your case. If you get approved, you’ll receive an appointment to come in person and pick up your new residence permit. If it’s your first time, you’ll receive an&nbsp;<em>Aufenthaltserlaubnis<\/em>, a limited permit that has an expiry date, which you can renew before it expires. This is the easiest way to do it because your company will handle all the application forms, and you share the responsibility of proving you’re a highly qualified person who deserves the position.<\/p>\n<div class=\"lr ls\">\n<div class=\"kp lt\">\n<h2 id=\"applying-for-your-residence-permit-as-a-freelancer-artist-or-self-employed\" class=\"at av bm dv gi gk gl gm go gp hr lu lv lw lx\"><strong>Applying for your residence permit as a freelancer, artist, or self-employed<\/strong><\/h2>\n<\/div>\n<\/div>\n<p class=\"\">The situation is slightly different if you’re interested in being self-employed, or working as a freelancer or artist rather than being in a full-time role at a company. You have to be able to show that you have enough funds to finance your life and your career without being a burden to the state. This applies to work in a variety of fields, including the arts. If you’re a freelance artist, journalist or musician, you must be able to demonstrate both a body of work and upcoming projects.<\/p>\n<p class=\"\">To get your residence permit in Germany as a freelancer or an artist, your application must include the following:<\/p>\n<ul>\n<li>\n<p class=\"\">Valid passport<\/p>\n<\/li>\n<li>\n<p class=\"\">1 current 35mm x 45mm biometric photo<\/p>\n<\/li>\n<li>\n<p class=\"\">Proof of health insurance<\/p>\n<\/li>\n<li>\n<p class=\"\">Proof of residence<\/p>\n<\/li>\n<li>\n<p class=\"\">Completed residence permit application form—also known as the&nbsp;<em>Antrag auf Erteilung eines Aufenthaltstitels<\/em><\/p>\n<\/li>\n<li>\n<p class=\"\">Curriculum Vitae (CV)—an updated document detailing your professional career, your diploma, any qualification certificates, and any references or sponsors<\/p>\n<\/li>\n<li>\n<p class=\"\">Financing plan—this document details how much money you have to finance your employment, including liquid funds, tangible assets, loans and venture capital<\/p>\n<\/li>\n<li>\n<p class=\"\">Revenue forecast—otherwise known as a profit\/loss statement that details your projected expenses including your rent, insurance fees and taxes for the next three years<\/p>\n<\/li>\n<li>\n<p class=\"\">€50 to €110 application fee, depending on the complexity of your case<\/p>\n<\/li>\n<\/ul>\n<p class=\"\">If you’re going to be self-employed, you’ll need everything above, plus a few additional documents:<\/p>\n<ul>\n<li>\n<p class=\"\">Company profile—this document details all the relevant information about your company including official proof of its existence, names of managing directors, total equity, annual turnover, official business address in your city, official function and more<\/p>\n<\/li>\n<li>\n<p class=\"\">Capital requirement plan—this document details all the potential costs you may incur or may require funding for to start your company, including office renovations, licensing fees, vehicle rentals and more<\/p>\n<\/li>\n<li>\n<p class=\"\">Business concept—this is a precise written set of descriptions about your company including the industry, the target customers, marketing and sales strategy, and market forecasts and risks<\/p>\n<\/li>\n<li>\n<p class=\"\">Business plan—this is a summary document of all the other documents above like your financing plan and revenue forecast that explains the high level function of your company<\/p>\n<\/li>\n<\/ul>\n<p class=\"\">This may sound like a lot, but you can find templates of most, if not all, of these documents on your city’s official web service portal. You’ll have to interpret line by line in German, but the format is largely the same as comparable documents in your home language. If you’ve never completed these kinds of documents before or are unsure about the exact figures for your capital requirements or revenues, it’s advisable to submit your best estimates, or even better—simply call your local immigration office to ask.<\/p>\n<div class=\"lr ls\">\n<div class=\"kp lt\">\n<h2 id=\"applying-for-your-residence-permit-as-a-student\" class=\"at av bm dv gi gk gl gm go gp hr lu lv lw lx\"><strong>Applying for your residence permit as a student<\/strong><\/h2>\n<\/div>\n<\/div>\n<p class=\"\">If you’re interested in studying at a German university, you can apply for a residence permit after you’ve successfully enrolled during your 90 days stay on your student visa. You’ll likely be offered a two-year residence permit, which you can easily extend for the full duration of your studies.<\/p>\n<p class=\"\">To get your residence permit in Germany as a university student, your application must include:<\/p>\n<ul>\n<li>\n<p class=\"\">Valid passport<\/p>\n<\/li>\n<li>\n<p class=\"\">1 current 35mm x 45mm biometric photo<\/p>\n<\/li>\n<li>\n<p class=\"\">Proof of health insurance<\/p>\n<\/li>\n<li>\n<p class=\"\">Proof of residence<\/p>\n<\/li>\n<li>\n<p class=\"\">Certificate of admission to your study course<\/p>\n<\/li>\n<li>\n<p class=\"\">Completed residence permit application form—also known as the&nbsp;<em>Antrag auf Erteilung eines Aufenthaltstitels<\/em><\/p>\n<\/li>\n<li>\n<p class=\"\">Proof of secure livelihood—this can be a German&nbsp;<em>Sperrkonto<\/em>&nbsp;bank account with at least €9,936, a notarized declaration from your parents guaranteeing to support your livelihood during your studies with proof of their income for the last six months, a scholarship, or a declaration of commitment (<em>Verpflichtungserklärung<\/em>) from another third party<\/p>\n<\/li>\n<li>\n<p class=\"\">€60 to €110 application fee, depending on the complexity of your case<\/p>\n<\/li>\n<\/ul>\n<p class=\"\">The process is almost identical if you’re interested in studying an intensive language course, which generally means you’ll attend daily lessons for a minimum of 18 hours per week. Night and weekend courses do not meet these requirements. The maximum length of a residence permit for language course students is one year.<\/p>\n<p class=\"\">To get your residence permit in Germany as a language course student, your application must include:<\/p>\n<ul>\n<li>\n<p class=\"\">Valid passport<\/p>\n<\/li>\n<li>\n<p class=\"\">1 current 35mm x 45mm biometric photo<\/p>\n<\/li>\n<li>\n<p class=\"\">Proof of health insurance<\/p>\n<\/li>\n<li>\n<p class=\"\">Proof of residence<\/p>\n<\/li>\n<li>\n<p class=\"\">Completed residence permit application form—also known as the&nbsp;<em>Antrag auf Erteilung eines Aufenthaltstitels<\/em><\/p>\n<\/li>\n<li>\n<p class=\"\">Proof of secure livelihood—this can be a German&nbsp;<em>Sperrkonto&nbsp;<\/em>bank account with at least €10,932, a notarized declaration from your parents guaranteeing to support your livelihood during your studies with proof of their income of the last six months, or a declaration of commitment (<em>Verpflichtungserklärung<\/em>) from another third party<\/p>\n<\/li>\n<li>\n<p class=\"\">Certificate of enrollment at your intensive language school<\/p>\n<\/li>\n<li>\n<p class=\"\">€60 to €110 application fee, depending on the complexity of your case<\/p>\n<\/li>\n<\/ul>\n<div class=\"lr ls\">\n<div class=\"kp lt\">\n<h2 id=\"becoming-a-permanent-resident-in-germany\" class=\"at av bm dv gi gk gl gm go gp hr lu lv lw lx\"><strong>Becoming a permanent resident in Germany<\/strong><\/h2>\n<\/div>\n<\/div>\n<p class=\"\">Once you’ve got your temporary residence permit and have lived in Germany for a while, you might start thinking about eventually becoming a permanent resident. For that to happen, you’ll want to apply for permanent residency (<em>Niederlassungserlaubnis)<\/em>, which will grant you the right to permanently live in Germany without an expiry date on your residence permit. You’ll also be allowed to work without needing approval from the Federal Employment Agency each time that you change jobs.<\/p>\n<p class=\"\">To apply to become a permanent resident in Germany, you must fulfill the following conditions:<\/p>\n<ul>\n<li>\n<p class=\"\">Five uninterrupted years of residence in Germany with a residence permit<\/p>\n<\/li>\n<li>\n<p class=\"\">Five years of secure livelihood, including health insurance and social insurance (pension) contributions<\/p>\n<\/li>\n<li>\n<p class=\"\">Adequate living space for you and your family (at least 13 sqm per person)<\/p>\n<\/li>\n<li>\n<p class=\"\">Working knowledge of the German language (at least B1 level)<\/p>\n<\/li>\n<li>\n<p class=\"\">Working knowledge of the German legal and social systems<\/p>\n<\/li>\n<li>\n<p class=\"\">No criminal record<\/p>\n<\/li>\n<\/ul>\n<p class=\"\">Gaining German citizenship by naturalization, obtaining a Blue Card and other ways to get your residence permit are outside the scope of this article, but are worth checking out if your case is unique. Perhaps the processes above can seem daunting, but it’s a lot easier when you remember that you only have to deal with the paperwork once a year, or once every few years. Plus, as many expats will tell you, the peace of mind that comes with being approved to live in Germany for longer than just a short holiday makes it worthwhile in the end.<\/p>\n<div class=\"lr ls\">\n<div class=\"kp lt\">\n<h2 id=\"tired-of-all-the-paperwork\" class=\"at av bm dv gi gk gl gm go gp hr lu lv lw lx\"><strong>Tired of all the paperwork?<\/strong><\/h2>\n<\/div>\n<\/div>\n<p class=\"\">Although we can’t complete your residency permit application for you, we definitely can offer a welcoming pause from all the paperwork. Join N26 to enjoy a 100% mobile banking experience, and simply manage your finances with just a few taps in your app. All you need to sign up is your smartphone, wifi, and just 8 minutes of your time—with absolutely zero paperwork involved. So, let’s find out:&nbsp;which N26 bank account is best for you?<\/p>\n<hr class=\"au aw az ba bb bc bq it ix ma mb\">\n<p class=\"mc\">Moving to Germany means navigating a lot of bureaucratic red tape, but opening a bank account doesn’t have to be so complicated. With N26, you can&nbsp;open a German bank account&nbsp;in minutes, right from your smartphone. All you need is a German address—no Anmeldung necessary. You’ll get a local German IBAN, which means no worrying about inconvenient T&amp;C’s that sometimes come with foreign IBANs. There are no hidden fees and you’ll always have access to English-speaking customer service, so the only thing left to worry about is settling in to your new home.<\/p>\n<\/div>\n<\/div>\n<div class=\"fl fy gc hw it md\">\n<p class=\"gi lc me mf\">BY&nbsp;N26<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>If you’re from outside the EU and you’ve decided to move to Germany, there’s one major piece of paperwork you need to take care of—the residence permit, or&nbsp;Aufenthaltstitel. This is the document that provides legal status to live in Germany for a longer period of time than your temporary traveling visa. We’ve previously offered guides [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":637,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"om_disable_all_campaigns":false,"ocean_post_layout":"","ocean_both_sidebars_style":"","ocean_both_sidebars_content_width":0,"ocean_both_sidebars_sidebars_width":0,"ocean_sidebar":"0","ocean_second_sidebar":"0","ocean_disable_margins":"enable","ocean_add_body_class":"","ocean_shortcode_before_top_bar":"","ocean_shortcode_after_top_bar":"","ocean_shortcode_before_header":"","ocean_shortcode_after_header":"","ocean_has_shortcode":"","ocean_shortcode_after_title":"","ocean_shortcode_before_footer_widgets":"","ocean_shortcode_after_footer_widgets":"","ocean_shortcode_before_footer_bottom":"","ocean_shortcode_after_footer_bottom":"","ocean_display_top_bar":"default","ocean_display_header":"default","ocean_header_style":"","ocean_center_header_left_menu":"0","ocean_custom_header_template":"0","ocean_custom_logo":0,"ocean_custom_retina_logo":0,"ocean_custom_logo_max_width":0,"ocean_custom_logo_tablet_max_width":0,"ocean_custom_logo_mobile_max_width":0,"ocean_custom_logo_max_height":0,"ocean_custom_logo_tablet_max_height":0,"ocean_custom_logo_mobile_max_height":0,"ocean_header_custom_menu":"0","ocean_menu_typo_font_family":"0","ocean_menu_typo_font_subset":"","ocean_menu_typo_font_size":0,"ocean_menu_typo_font_size_tablet":0,"ocean_menu_typo_font_size_mobile":0,"ocean_menu_typo_font_size_unit":"px","ocean_menu_typo_font_weight":"","ocean_menu_typo_font_weight_tablet":"","ocean_menu_typo_font_weight_mobile":"","ocean_menu_typo_transform":"","ocean_menu_typo_transform_tablet":"","ocean_menu_typo_transform_mobile":"","ocean_menu_typo_line_height":0,"ocean_menu_typo_line_height_tablet":0,"ocean_menu_typo_line_height_mobile":0,"ocean_menu_typo_line_height_unit":"","ocean_menu_typo_spacing":0,"ocean_menu_typo_spacing_tablet":0,"ocean_menu_typo_spacing_mobile":0,"ocean_menu_typo_spacing_unit":"","ocean_menu_link_color":"","ocean_menu_link_color_hover":"","ocean_menu_link_color_active":"","ocean_menu_link_background":"","ocean_menu_link_hover_background":"","ocean_menu_link_active_background":"","ocean_menu_social_links_bg":"","ocean_menu_social_hover_links_bg":"","ocean_menu_social_links_color":"","ocean_menu_social_hover_links_color":"","ocean_disable_title":"default","ocean_disable_heading":"default","ocean_post_title":"","ocean_post_subheading":"","ocean_post_title_style":"","ocean_post_title_background_color":"","ocean_post_title_background":0,"ocean_post_title_bg_image_position":"","ocean_post_title_bg_image_attachment":"","ocean_post_title_bg_image_repeat":"","ocean_post_title_bg_image_size":"","ocean_post_title_height":0,"ocean_post_title_bg_overlay":0.5,"ocean_post_title_bg_overlay_color":"","ocean_disable_breadcrumbs":"default","ocean_breadcrumbs_color":"","ocean_breadcrumbs_separator_color":"","ocean_breadcrumbs_links_color":"","ocean_breadcrumbs_links_hover_color":"","ocean_display_footer_widgets":"default","ocean_display_footer_bottom":"default","ocean_custom_footer_template":"0","_jetpack_memberships_contains_paid_content":false,"_joinchat":[],"ocean_post_oembed":"","ocean_post_self_hosted_media":"","ocean_post_video_embed":"","ocean_link_format":"","ocean_link_format_target":"self","ocean_quote_format":"","ocean_quote_format_link":"post","ocean_gallery_link_images":"off","ocean_gallery_id":[],"footnotes":""},"categories":[64],"tags":[],"class_list":["post-1464","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-residence-permit","entry","has-media"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to get your residence permit in Germany, German resident permite<\/title>\n<meta name=\"description\" content=\"How to get your residence permit in Germany, The process for applying for a Germany residence permit goes as follows: buy germany resident permite online\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"europedeadmin18\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/\"},\"author\":{\"name\":\"europedeadmin18\",\"@id\":\"https:\/\/www.europeandocsexpress.com\/#\/schema\/person\/12a506039156579e2b1e344e4c4036b6\"},\"headline\":\"How to get your residence permit in Germany\",\"datePublished\":\"2021-04-04T16:46:57+00:00\",\"dateModified\":\"2022-05-26T18:03:04+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/\"},\"wordCount\":1905,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/www.europeandocsexpress.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/#primaryimage\"},\"thumbnailUrl\":\"\",\"articleSection\":[\"Residence Permit\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/\",\"url\":\"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/\",\"name\":\"How to get your residence permit in Germany, German resident permite\",\"isPartOf\":{\"@id\":\"https:\/\/www.europeandocsexpress.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/#primaryimage\"},\"thumbnailUrl\":\"\",\"datePublished\":\"2021-04-04T16:46:57+00:00\",\"dateModified\":\"2022-05-26T18:03:04+00:00\",\"description\":\"How to get your residence permit in Germany, The process for applying for a Germany residence permit goes as follows: buy germany resident permite online\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/#primaryimage\",\"url\":\"\",\"contentUrl\":\"\"},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.europeandocsexpress.com\/#website\",\"url\":\"https:\/\/www.europeandocsexpress.com\/\",\"name\":\"European Docs Express\",\"description\":\"My WordPress Blog\",\"publisher\":{\"@id\":\"https:\/\/www.europeandocsexpress.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.europeandocsexpress.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.europeandocsexpress.com\/#organization\",\"name\":\"European Docs Express\",\"url\":\"https:\/\/www.europeandocsexpress.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.europeandocsexpress.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.europeandocsexpress.com\/wp-content\/uploads\/2022\/05\/logo.png\",\"contentUrl\":\"https:\/\/www.europeandocsexpress.com\/wp-content\/uploads\/2022\/05\/logo.png\",\"width\":275,\"height\":100,\"caption\":\"European Docs Express\"},\"image\":{\"@id\":\"https:\/\/www.europeandocsexpress.com\/#\/schema\/logo\/image\/\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.europeandocsexpress.com\/#\/schema\/person\/12a506039156579e2b1e344e4c4036b6\",\"name\":\"europedeadmin18\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/www.europeandocsexpress.com\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/23326acd27fcd124b92762d11ef1fac9?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/23326acd27fcd124b92762d11ef1fac9?s=96&d=mm&r=g\",\"caption\":\"europedeadmin18\"},\"sameAs\":[\"https:\/\/www.europeandocsexpress.com\/\"],\"url\":\"https:\/\/www.europeandocsexpress.com\/author\/europedeadmin18\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to get your residence permit in Germany, German resident permite","description":"How to get your residence permit in Germany, The process for applying for a Germany residence permit goes as follows: buy germany resident permite online","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/","twitter_misc":{"Written by":"europedeadmin18","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/#article","isPartOf":{"@id":"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/"},"author":{"name":"europedeadmin18","@id":"https:\/\/www.europeandocsexpress.com\/#\/schema\/person\/12a506039156579e2b1e344e4c4036b6"},"headline":"How to get your residence permit in Germany","datePublished":"2021-04-04T16:46:57+00:00","dateModified":"2022-05-26T18:03:04+00:00","mainEntityOfPage":{"@id":"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/"},"wordCount":1905,"commentCount":0,"publisher":{"@id":"https:\/\/www.europeandocsexpress.com\/#organization"},"image":{"@id":"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/#primaryimage"},"thumbnailUrl":"","articleSection":["Residence Permit"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/","url":"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/","name":"How to get your residence permit in Germany, German resident permite","isPartOf":{"@id":"https:\/\/www.europeandocsexpress.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/#primaryimage"},"image":{"@id":"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/#primaryimage"},"thumbnailUrl":"","datePublished":"2021-04-04T16:46:57+00:00","dateModified":"2022-05-26T18:03:04+00:00","description":"How to get your residence permit in Germany, The process for applying for a Germany residence permit goes as follows: buy germany resident permite online","inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/"]}]},{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.europeandocsexpress.com\/2021\/04\/04\/how-to-get-your-residence-permit-in-germany\/#primaryimage","url":"","contentUrl":""},{"@type":"WebSite","@id":"https:\/\/www.europeandocsexpress.com\/#website","url":"https:\/\/www.europeandocsexpress.com\/","name":"European Docs Express","description":"My WordPress Blog","publisher":{"@id":"https:\/\/www.europeandocsexpress.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.europeandocsexpress.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/www.europeandocsexpress.com\/#organization","name":"European Docs Express","url":"https:\/\/www.europeandocsexpress.com\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.europeandocsexpress.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.europeandocsexpress.com\/wp-content\/uploads\/2022\/05\/logo.png","contentUrl":"https:\/\/www.europeandocsexpress.com\/wp-content\/uploads\/2022\/05\/logo.png","width":275,"height":100,"caption":"European Docs Express"},"image":{"@id":"https:\/\/www.europeandocsexpress.com\/#\/schema\/logo\/image\/"}},{"@type":"Person","@id":"https:\/\/www.europeandocsexpress.com\/#\/schema\/person\/12a506039156579e2b1e344e4c4036b6","name":"europedeadmin18","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/www.europeandocsexpress.com\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/23326acd27fcd124b92762d11ef1fac9?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/23326acd27fcd124b92762d11ef1fac9?s=96&d=mm&r=g","caption":"europedeadmin18"},"sameAs":["https:\/\/www.europeandocsexpress.com\/"],"url":"https:\/\/www.europeandocsexpress.com\/author\/europedeadmin18\/"}]}},"jetpack_sharing_enabled":true,"jetpack_featured_media_url":"","_links":{"self":[{"href":"https:\/\/www.europeandocsexpress.com\/wp-json\/wp\/v2\/posts\/1464"}],"collection":[{"href":"https:\/\/www.europeandocsexpress.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.europeandocsexpress.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.europeandocsexpress.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.europeandocsexpress.com\/wp-json\/wp\/v2\/comments?post=1464"}],"version-history":[{"count":1,"href":"https:\/\/www.europeandocsexpress.com\/wp-json\/wp\/v2\/posts\/1464\/revisions"}],"predecessor-version":[{"id":2696,"href":"https:\/\/www.europeandocsexpress.com\/wp-json\/wp\/v2\/posts\/1464\/revisions\/2696"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.europeandocsexpress.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/www.europeandocsexpress.com\/wp-json\/wp\/v2\/media?parent=1464"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.europeandocsexpress.com\/wp-json\/wp\/v2\/categories?post=1464"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.europeandocsexpress.com\/wp-json\/wp\/v2\/tags?post=1464"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}